heroName = input("Введите имя героя:")
villainName = input("Введите имя злодея: ")
heroWeapon = input("Введите оружие героя:")
city = input("Введите название города:")
heroAge = int(input("Введите возраст героя: "))

print(f"Однажды в королевстве {city}е герою по имени {heroName} не было {heroAge} лет. Злой {villainName} напал на королевство со своей армией ужасных людей. Жители королевства были в ужасе и не знали, что им делать")

print(f"Но {heroName} был смел и полон решимости спасти свое королевство. Он схватил свое верное {heroWeapon} и отправился на поединок с {villainName}ом . После долгой и жестокой битвы {heroName} вышел победителем и спас королевство от верной гибели.")

print(f"Жители {city} радовались и праздновали победу своего героя. С этого дня {heroName} был известен как спаситель {city}. И с тех пор они долгое время жили в мире и благополучии. На этом сказка заканчивается, ура ура ура!")